# -*- coding:utf-8 -*-
##传统知识+古典密码
##题目链接，http://www.shiyanbar.com/ctf/1991
GanZhi={"甲子":1,"乙丑":2,"丙寅":3,"丁卯":4,"戊辰":5,"己巳":6,"庚午":7,"辛未":8,"壬申":9,"癸酉":10,"甲戌":11,"乙亥":12,"丙子":13,"丁丑":14,"戊寅":15,"己卯":16,"庚辰":17,"辛巳":18,"壬午":19,"癸未":20,"甲申":21,"乙酉":22,"丙戌":23,"丁亥":24,"戊子":25,"己丑":26,"庚寅":27,"辛卯":28,"壬辰":29,"癸巳":30,"甲午":31,"乙未":32,"丙申":33,"丁酉":34,"戊戌":35,"己亥":36,"庚子":37,"辛丑":38,"壬寅":39,"癸卯":40,"甲辰":41,"乙巳":42,"丙午":43,"丁未":44,"戊申":45,"己酉":46,"庚戌":47,"辛亥":48,"壬子":49,"癸丑":50,"甲寅":51,"乙卯":52,"丙辰":53,"丁巳":54,"戊午":55,"己未":56,"庚申":57,"辛酉":58,"壬戌":59,"癸亥":60}
string = "辛卯，癸巳，丙戌，辛未，庚辰，癸酉，己卯，癸巳"
ls = string.split("，")
print ''.join([chr(GanZhi[gz]+60) for gz in ls])
